import { LocaleType } from '@/components/internationalization';

export const ru: LocaleType = {
  404: {
    description: 'Эту страницу не удалось найти',
  },
  common: {
    notFound: 'НИЧЕГО НЕ НАЙДЕНО',
    noData: 'НЕТ ДАННЫХ',
    loading: 'Загрузка...',
  },
  header: {
    articles: 'Статьи',
    places: 'Места',
    people: 'Люди',
    aboutProject: 'О проекте',
    map: 'Карта',
    signIn: 'Вход',
    signUp: 'Регистрация',
    dashboard: 'Приборная панель',
    settings: 'Настройки',
    logout: 'Выход',
  },
  footer: {
    pages: 'Страницы',
    contacts: 'Контакты',
    partners: 'Партнеры',
    socialNetworks: 'Социальные сети',
  },
  auth: {
    signIn: {
      page: {
        titleT: 'Войдите в свой аккаунт',
        buttonGT: 'Войти через',
        descriptionT: 'или войдите с помощью электронной почты',
        emailT: 'АДРЕС ЭЛЕКТРОННОЙ ПОЧТЫ',
        passwordT: 'ПАРОЛЬ',
        forgotT: 'Забыли пароль?',
        buttonSignInT: 'Войти',
        noAccT: 'У вас нет аккаунта?',
        signUpT: 'Зарегистрироваться',
        successMessage: 'Вы успешно вошли в систему! Перенаправление...',
        schema: {
          emailT: 'Поле "Адрес электронной почты" обязательно',
          passwordT: 'Поле "Пароль" обязательно',
        },
        customErrors:
          'Неправильный пароль, email или имя пользователя. Попробуйте ещё раз, пожалуйста',
        STATUS_ERROR_401_TR: `Этот аккаунт отсутствует в системе, если вы хотите зарегистрироваться, перейдите на страницу "Зарегистрироваться"`,
        STATUS_ERROR_400_TR: 'Неправильный пароль, email или имя пользователя',
        STATUS_ERROR_204_TR:
          'Пользователь с таким email уже существует. Проверьте свою почту для получения дальнейших инструкций',
      },
      indexTitle: 'Вход',
    },
    signUp: {
      indexTitle: 'Регистрация',
      page: {
        titleT: 'Регистрация',
        buttonGoogleT: 'Войти через',
        descriptionT: 'или',
        buttonShowFormT: 'Регистрация',
        buttonHiddenFormT: 'Скрыть форму',
        nameT: 'ИМЯ ПОЛЬЗОВАТЕЛЯ',
        emailT: 'АДРЕС ЭЛЕКТРОННОЙ ПОЧТЫ',
        passwordT: 'ПАРОЛЬ',
        // passwordPlaceholderT: '6+ символов',
        descriptionFormT:
          'Пароль должен быть не менее 6 символов, включать большие и маленькие латинские буквы, а также цифры.',
        buttonSignUpT: 'Зарегистрироваться',
        descriptionSignInT: 'У вас уже есть аккаунт?',
        signInLinkT: 'Войти',
        sentEmailT:
          'Регистрация успешно завершена! Пожалуйста, проверьте свою почту. Мы отправили вам письмо с подтверждением. Если вы не видите письмо в папке входящих, проверьте папку "Спам".',
        schema: {
          userName: {
            required: 'Поле "Имя пользователя" обязательно для заполнения',
            min: 'Минимальное количество символов: 6',
            max: 'Максимальное количество символов: 30',
          },
          email: {
            required:
              'Поле "Адрес электронной почты" обязательно для заполнения',
            email: 'Адрес электронной почты должен быть валидным',
          },
          password: {
            required: 'Поле "Пароль" обязательно для заполнения',
            min: 'Минимальное количество символов: 6',
            max: 'Пароль должен содержать не более 20 символов',
            matches:
              'Пароль должен содержать хотя бы одну цифру, одну заглавную букву, одну строчную букву и один специальный символ.',
          },
        },
      },
    },
    forgotPassword: {
      indexTitle: 'Забыли пароль',
      page: {
        showMessageT: `Если этот адрес электронной почты использовался для создания учетной записи, инструкции для сброса пароля будут отправлены вам. Проверьте свою электронную почту.`,
        signInLink: 'Перейти к входу',
        titleT: 'Забыли пароль?',
        descriptionFirstT: `Введите адрес электронной почты, который вы использовали при регистрации, и мы отправим вам инструкции по сбросу пароля.`,
        descriptionSecondT: `В целях безопасности мы НЕ храним ваш пароль. Так что отдохните, уверены, что мы никогда не отправим ваш пароль по электронной почте.`,
        emailT: 'АДРЕС ЭЛЕКТРОННОЙ ПОЧТЫ',
        captchaT: {
          titleT: 'Этот сайт защищен reCAPTCHA Enterprise и Google',
          private: 'Политика конфиденциальности',
          rules: 'Условия использования',
        },
        buttonT: 'Отправить инструкции',
      },
    },
    recovery: {
      indexTile: 'Восстановление',
      resendPage: {
        firstDescription: `Срок действия ссылки для проверки электронной почты истек`,
        secondDescription: `Не беспокойтесь, мы можем отправить ссылку еще раз`,
        forgotPasswordLink: `Повторно отправить ссылку для проверки`,
      },
      recoveryPage: {
        labelT: 'НОВЫЙ ПАРОЛЬ',
        // placeholderT: '6+ символов',
        descriptionT:
          'Пароль должен содержать хотя бы одну цифру, одну заглавную букву, одну строчную букву и один специальный символ.',
        buttonT: 'Создать новый пароль',
        errorT: {
          passwordT: 'Поле "Новый пароль" обязательно для заполнения',
        },
        successMessage: 'Пароль успешно изменен! Перенаправление...',
      },
    },
    registrationConfirmation: {
      emailSuccessMessage: {
        headTitleT: 'Подтверждение по электронной почте',
        titleT: 'Поздравляем!',
        descriptionT: 'Ваш электронный адрес был подтвержден',
        signInT: 'Войти',
      },
    },
    resendForm: {
      headTitle: 'Отправка подтверждения восстановления пароля',
      titleT: 'Форма повторной отправки',
      resendLinkT: 'Отправить ссылку для подтверждения снова',
      emailT: 'Электронная почта',
      sendT: 'Отправить',
      errorT: {
        emailT: 'Поле "Адрес электронной почты" обязательно для заполнения',
      },
    },
    ResendingVerificationLink: {
      headTitleT:
        'Срок действия ссылки для подтверждения по электронной почте истек',
      titleT:
        'Срок действия ссылки для подтверждения по электронной почте истек',
      descriptionT:
        'Похоже, что ссылка для подтверждения истекла. Не волнуйтесь, мы можем отправить ссылку снова',
      resendLinkT: 'Отправить ссылку для подтверждения снова',
    },
  },
  home: {
    page: {
      homeHero: {
        graveTitle: 'МОГИЛКИ',
        archiveTitle: 'АРХИВ',
        description: `Могилки - это специальный портал для людей, которые интересуются 
              историей и архивными данными. На сайте есть интерактивная карта, 
              где вы найдете захоронения белорусов на территории Республики 
              Польша.`,
        linkButton: 'подробнее',
      },
      homeArticles: {
        titleT: 'Статьи',
        buttonT: 'читать все',
      },
      homeMap: {
        titleFirstT: 'Интерактивная',
        titleSecondT: 'Карта',
        descriptionFirstT: `Координаты могилок`,
        descriptionSecondT: `Можно отметить могилку самостоятельно`,
        linkT: 'читать все',
        descriptionEnd: 'работает на всех устройствах',
      },
    },
    indexTitle: 'Главная страница',
  },
  articles: {
    indexTitle: 'Статьи',
    page: {
      title: 'Статьи',
      article: 'Статьи',
      // noData: 'НЕТ ДАННЫХ',
      search: 'НАЙТИ ПО ЗАГОЛОВКУ',
    },
    article: {
      prev: 'Предыдущий',
    },
  },
  places: {
    indexTitle: 'Места',
    page: {
      title: 'Архив_Мест',
      archive: 'Архив',
      place: '_Мест',
      name: 'ИМЯ',
      country: 'СТРАНА',
      city: 'ГОРОД',
      // noData: 'НИЧЕГО НЕ НАЙДЕНО',
    },
    place: {
      page: {
        titleLink: 'Архив_Мест',
        archive: 'Архив',
        grave: '_Могил',
        location: 'Место нахождения',
        description: 'Описание',
        map: {
          show: 'Показать карту',
          hide: 'Скрыть карту',
        },
        // notData: 'НЕТ ДАННЫХ',
      },
      indexTitle: 'Место',
    },
  },
  people: {
    indexTitle: 'Люди',
    search: {
      indexTitle: 'Поиск',
      page: {
        title: 'Поиск',
        placeholder: 'Поиск',
        name: 'ИМЯ',
        lastName: 'ФАМИЛИЯ',
        // patronymic: 'ОТЧЕСТВО',
        birthDate: 'ГОД РОЖДЕНИЯ',
        error: 'Неправильный формат даты',
        deathDate: 'ГОД СМЕРТИ',
        country: 'СТРАНА',
        city: 'ГОРОД',
        gte: 'БОЛЬШЕ ЧЕМ',
        lte: 'МЕНЬШЕ ЧЕМ',
        search: 'ПОИСК',
        clear: 'ОЧИСТИТЬ',
        // noData: 'НИЧЕГО НЕ НАЙДЕНО',
      },
    },
    page: {
      title: 'Архив_Людей',
      archive: 'Архив',
      people: '_Людей',
      // noData: 'НЕТ ДАННЫХ',
    },
    person: {
      indexTitle: 'Человек',
      page: {
        titleLink: 'Архив_Людей',
        archive: 'Архив',
        grave: '_Личность',
        location: 'Место нахождения',
        biography: 'Биография',
        map: {
          show: 'Показать карту',
          hide: 'Скрыть карту',
        },
        notData: 'Нет данных',
        prev: 'Предыдущий',
      },
    },
  },
  aboutTheProject: {
    indexTitle: 'О проекте',
    page: {
      title: 'О_проекте',
      description: `Могилки - это специальный портал для людей, которые интересуются 
        историей и архивными данными. На сайте есть интерактивная карта,
        где вы найдете захоронения белорусов на территории Республики Польша.`,
    },
  },
  map: {
    indexTitle: 'Карта',
    page: {
      title: 'Интерактивная_Карта',
      header: 'Интерактивная Карта',
      search: 'НАЙТИ',
      loading: 'Загрузка',
    },
  },
  account: {
    indexTitle: 'Редактировать профиль',
    page: {
      title: 'Редактировать аккаунт',
      name: 'НИКНЕЙМ',
      descriptionImage: 'JPG, GIF или PNG. Максимальный размер 2 Мб',
      city: 'ГОРОД',
      buttonSave: 'Сохранить',
      errorMessage: 'Размер файла превышает 2 мегабайта',
      schema: {
        userName: {
          min: 'Минимальное количество символов - 6',
          max: 'Максимальное количество символов - 30',
          matches: 'Разрешены только символы 0-9, A-Z, a-z, _, -',
          required: 'Имя пользователя обязательно',
        },
      },
    },
  },
  dashboard: {
    indexTitle: 'Приборная панель',
    menu: {
      menu: 'Меню',
      dashboard: 'Приборная панель',
      map: 'Карта',
      gallery: 'Галерея',
      content: 'Контент',
      articles: 'Статьи',
      places: 'Места',
      people: 'Люди',
      settings: 'Настройки',
      users: 'Пользователи',
      contacts: 'Контакты',
      languages: 'Языки',
      logout: 'Выход',
    },
    map: {
      titleLink: 'Приборная панель',
      search: 'Поиск',
      button: 'Приблизить к Польше',
    },
    gallery: {
      title: 'Галерея',
      support: 'Поддерживаемые форматы',
      maxFileSize: 'Максимальный разрешенный размер файла',
      image: {
        title: 'Информация о файле',
        alt: 'Альт',
        status: 'Статус',
        type: 'Тип',
        mime: 'Mime',
        fileSize: 'Размер файла',
        demensions: 'Размеры',
        owner: 'Владелец',
        createdAt: 'Создано',
        relations: {
          article: {
            id: 'ID статьи',
            title: 'Статья',
          },
          place: {
            id: 'ID места',
            title: 'Место',
          },
          person: {
            id: 'ID личности',
            title: 'Личность',
          },
        },
        notifications: {
          success: {
            title: 'Изображение успешно создано',
            description: 'Вы будете перенаправлены на страницу галереи',
          },
          upload: {
            success: {
              title: 'Файл успешно загружен',
              description: 'Все файлы успешно загружены',
            },
            errorType: {
              title: 'Ошибка загрузки файла',
              description: 'Тип файла не поддерживается',
            },
            errorSize: {
              title: 'Ошибка загрузки файла',
              description: `Размер файла больше, чем 10МБ`,
            },
            remove: {
              title: 'Файл удален',
              description: 'Файл успешно удален',
            },
            failed: {
              title: 'Ошибка загрузки файла',
              description: 'Файл не загружен',
            },
          },
          update: {
            title: 'Изображение успешно обновлено',
            description: 'Вы будете перенаправлены на страницу галереи',
          },
          delete: {
            title: 'Изображение успешно удалено',
            description: 'Вы будете перенаправлены на страницу галереи',
          },
          error: 'Ошибка создания изображения',
        },
      },
    },
    articles: {
      index: 'Статьи',
      add: {
        label: '+ Добавить',
        title: 'Добавить статью',
      },
      search: {
        title: 'Поиск по заголовку',
        placeholder: 'Поиск по заголовку',
      },
      table: {
        id: 'ID',
        owner: 'Владелец',
        title: 'Заголовок',
        createdAt: 'Создано',
        updatedAt: 'Обновлено',
        status: 'Статус',
        photos: 'Фотографии',
        actions: 'Действия',
      },
      notifications: {
        success: {
          title: 'Статья успешно создана',
          description: 'Вы будете перенаправлены на страницу статьи',
        },
        delete: {
          title: 'Статья успешно удалена',
          description: 'Вы будете перенаправлены на страницу статьи',
        },
      },
      delete: {
        title: 'Удалить',
        titleConfirm: 'Подтвердите удаление',
        description: 'Вы уверены, что хотите удалить статью?',
        cancel: 'Отмена',
        delete: 'Удалить',
      },
      updateModal: {
        title: 'Изменить статус статьи или отредактировать',
        buttonTitle: 'Изменить статус статьи',
        form: {
          label: 'Текущий статус',
        },
        edit: 'Редактировать',
        notification: {
          success: 'Статус успешно обновлен',
          error: 'Ошибка обновления статуса',
        },
      },
      form: {
        title: {
          label: 'Заголовок',
          placeholder: 'Заголовок',
          tooltip:
            'Вы можете написать до 155 символов. После написания вы должны сохранить статью.',
          rules: {
            required: 'Поле "Заголовок" обязательно',
            max: 'Максимальная длина: 155 символов',
          },
        },
        description: {
          label: 'Краткое описание',
          placeholder: 'Краткое описание',
          tooltip:
            'Вы можете написать до 355 символов. После написания вы должны сохранить статью.',
          rules: {
            required: 'Поле "Краткое описание" обязательно',
            max: 'Максимальная длина: 355 символов',
          },
        },
        content: {
          label: 'Содержание',
          tooltip:
            'Вы можете написать до 10 000 символов. После написания вы должны сохранить статью.',
          rules: {
            required: 'Поле "Содержание" обязательно',
            max: 'Максимальная длина: 10 000 символов',
          },
        },
        photo: {
          label: 'Фото',
          tooltip:
            'Вы можете загрузить до 1 фото. После загрузки вы должны сохранить статью.',
          rules: {
            required: 'Поле "Фото" обязательно',
            max: 'Максимальное количество: 1 фото',
          },
        },
      },
      create: {
        index: 'Создать статью',
        notification: {
          success: {
            title: 'Статья успешно создана',
            description: 'Вы будете перенаправлены на страницу статьи',
          },
          error: 'Ошибка создания статьи',
        },
        button: {
          save: 'Сохранить',
          photo: '+ Загрузить',
        },
      },
      edit: {
        index: 'Редактировать статью',
        notification: {
          success: {
            title: 'Статья успешно обновлена',
            description: 'Вы будете перенаправлены на страницу статьи',
          },
          update: {
            title: 'Статья успешно обновлена',
          },
          delete: {
            title: 'Статья успешно удалена',
          },
          error: 'Ошибка при обновлении статьи',
        },
        button: {
          save: 'Сохранить',
          photo: '+ Загрузить',
        },
      },
    },
    places: {
      index: 'Места',
      add: {
        label: '+ Добавить',
        title: 'Добавить место',
      },
      search: {
        name: {
          title: 'Поиск по имени',
          placeholder: 'Поиск по имени',
        },
        country: {
          title: 'Поиск по стране',
          placeholder: 'Поиск по стране',
        },
        city: {
          title: 'Поиск по городу',
          placeholder: 'Поиск по городу',
        },
      },
      table: {
        id: 'ID',
        owner: 'Владелец',
        name: 'Имя',
        country: 'Страна',
        city: 'Город',
        createdAt: 'Создано',
        updatedAt: 'Обновлено',
        status: 'Статус',
        photos: 'Фотографии',
        persons: 'Личности',
        actions: 'Действия',
      },
      notifications: {
        success: {
          title: 'Место успешно создано',
          description: 'Вы будете перенаправлены на страницу места',
        },
        delete: {
          title: 'Место успешно удалено',
          description: 'Вы будете перенаправлены на страницу мест',
        },
      },
      form: {
        country: {
          label: 'Страна',
          placeholder: 'Страна',
          tooltip:
            'Вы можете написать до 120 символов. После записи вы должны сохранить место.',
          rules: {
            required: 'Поле "Страна" обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        city: {
          label: 'Город',
          placeholder: 'Город',
          tooltip:
            'Вы можете написать до 120 символов. После записи вы должны сохранить город.',
          rules: {
            required: 'Поле "Город" обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        nameCemetery: {
          label: 'Название кладбища',
          placeholder: 'Название кладбища',
          tooltip:
            'Вы можете написать до 120 символов. После записи вы должны сохранить название кладбища.',
          rules: {
            required: 'Поле "Название кладбища" обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        shortDescription: {
          label: 'Краткое описание',
          placeholder: 'Краткое описание',
          tooltip:
            'Вы можете написать до 300 символов. После записи вы должны сохранить место.',
          rules: {
            required: 'Поле "Краткое описание" обязательно для заполнения',
            max: 'Максимальная длина: 300 символов',
          },
        },
        description: {
          label: 'Описание',
          placeholder: 'Описание',
          tooltip:
            'Вы можете написать до 5 000 символов. После записи вы должны сохранить место.',
          rules: {
            required: 'Поле "Описание" обязательно для заполнения',
            max: 'Максимальная длина: 5 000 символов',
          },
        },
        photo: {
          label: 'Фото',
          tooltip:
            'Вы можете загрузить до 1 фото. После загрузки вы должны сохранить место.',
          rules: {
            required: 'Поле "Фото" обязательно для заполнения',
            max: 'Максимальная длина: 1 фото',
          },
        },
      },
      create: {
        index: 'Создать место',
        notification: {
          success: {
            title: 'Место успешно создано',
            description: 'Вы будете перенаправлены на страницу места',
          },
          error: 'Ошибка при создании места',
        },
        button: {
          save: 'Сохранить',
          photo: '+ Загрузить',
        },
      },
      edit: {
        index: 'Редактировать место',
        notification: {
          success: {
            title: 'Место успешно обновлено',
            description: 'Вы будете перенаправлены на страницу места',
          },
          update: {
            title: 'Место успешно обновлено',
          },
          delete: {
            title: 'Место успешно удалено',
          },
          error: 'Ошибка при обновлении места',
        },
        button: {
          save: 'Сохранить',
          photo: '+ Загрузить',
        },
      },
      delete: {
        title: 'Удалить',
        titleConfirm: 'Подтвердить удаление',
        description: 'Вы уверены, что хотите удалить место?',
        cancel: 'Отмена',
        delete: 'Удалить',
      },
      updateModal: {
        title: 'Изменение статуса места или редактирование',
        buttonTitle: 'Изменить статус места',
        form: {
          label: 'Текущий статус',
        },
        edit: 'Редактировать',
        notification: {
          success: 'Статус успешно обновлен',
          error: 'Ошибка обновления статуса',
        },
      },
    },
    persons: {
      index: 'Личности',
      add: {
        label: '+ Добавить',
        title: 'Добавить личность',
      },
      filters: {
        title: 'Фильтры',
        placeholder: 'Показать больше фильтров',
      },
      search: {
        more: 'Больше',
        less: 'Меньше',
        name: {
          title: 'Поиск по имени',
          placeholder: 'Поиск по имени',
        },
        lastName: {
          title: 'Поиск по фамилии',
          placeholder: 'Поиск по фамилии',
        },
        birthDate: {
          title: 'Поиск по дате рождения',
          placeholder: 'Год рождения',
        },
        deathDate: {
          title: 'Поиск по дате смерти',
          placeholder: 'Год смерти',
        },
        country: {
          title: 'Поиск по стране',
          placeholder: 'Поиск по стране',
        },
        city: {
          title: 'Поиск по городу',
          placeholder: 'Поиск по городу',
        },
      },
      form: {
        name: {
          label: 'Имя',
          placeholder: 'Имя',
          tooltip:
            'Вы можете написать до 120 символов. После написания вы должны сохранить имя.',
          rules: {
            required: 'Поле Имя обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        lastName: {
          label: 'Фамилия',
          placeholder: 'Фамилия',
          tooltip:
            'Вы можете написать до 120 символов. После написания вы должны сохранить фамилию.',
          rules: {
            required: 'Поле Фамилия обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        patronymic: {
          label: 'Отчество',
          placeholder: 'Отчество',
          tooltip:
            'Вы можете написать до 120 символов. После написания вы должны сохранить отчество.',
          rules: {
            max: 'Максимальная длина: 120 символов',
          },
        },
        biography: {
          label: 'Биография',
          placeholder: 'Биография',
          tooltip:
            'Вы можете написать до 500 символов. После написания вы должны сохранить статью.',
          rules: {
            max: 'Максимальная длина: 500 символов',
          },
        },
        birthDate: {
          label: 'День рождения',
          placeholder: 'День рождения',
          tooltip:
            'Вы можете написать до 120 символов. После написания вы должны сохранить дату рождения.',
          rules: {
            required: 'Поле Дата рождения обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        birthDay: {
          label: 'Дата Рождения',
          placeholder: 'Дата',
        },
        birthMonth: {
          label: 'Месяц Рождения',
          placeholder: 'Месяц',
        },
        birthYear: {
          label: 'Год Рождения',
          placeholder: 'Год',
        },
        deathDate: {
          label: 'Дата смерти',
          placeholder: 'Дата смерти',
          tooltip:
            'Вы можете написать до 120 символов. После написания вы должны сохранить дату смерти.',
          rules: {
            // required: 'Поле Дата смерти обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        deathDay: {
          label: 'День Смерти',
          placeholder: 'День',
        },
        deathMonth: {
          label: 'Месяц Смерти',
          placeholder: 'Месяц',
        },
        deathYear: {
          label: 'Год Смерти',
          placeholder: 'Год',
        },
        country: {
          label: 'Страна',
          placeholder: 'Страна',
          na: 'Незаполнено',
          tooltip:
            'Это поле заполняется автоматически, когда вы выбираете местоположение на карте.',
          rules: {
            required: 'Поле Страна обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        city: {
          label: 'Город',
          placeholder: 'Город',
          na: 'Незаполнено',
          tooltip:
            'Это поле заполняется автоматически, когда вы выбираете местоположение на карте.',
          rules: {
            required: 'Поле Город обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        photo: {
          label: 'Фото',
          tooltip:
            'Вы можете загрузить до 3 фото, но одно из них должно быть обязательным. Первое фото будет отображаться на странице личности. После загрузки вы должны сохранить личность.',
          rules: {
            required: 'Поле Фото обязательно для заполнения',
            max: 'Максимальное количество: 3 фото',
          },
        },
      },
      place: {
        label: 'Место',
        placeholder: 'Место',
        name: 'Имя',
        country: 'Страна',
        city: 'Город',
        searchPlaceholder: 'Поиск места',
        selectedPlace: 'Выбранное место',
        address: 'Форматированный адрес',
        tooltip:
          'Выберите местоположение из списка, чтобы связать его с конкретным местом на карте.',
        clear: 'Очистить',
      },
      create: {
        index: 'Создать человека',
        notification: {
          success: {
            title: 'Человек успешно создан',
            description: 'Вы будете перенаправлены на страницу человека',
          },
          error: 'Ошибка создания места',
        },
        button: {
          save: 'Сохранить',
          photo: '+ Загрузить',
        },
        tour: {
          next: 'Следующий',
          previous: 'Предыдущий',
          finish: 'Завершить',
          steps: {
            createPerson: {
              title: 'Создание Личности',
              description:
                'Добро пожаловать на страницу создания личности. Давайте начнем!',
            },
            basicInformation: {
              title: 'Основная Информация',
              description: 'Заполните основную информацию о личности.',
            },
            firstName: {
              title: 'Имя',
              description: 'Введите имя личности.',
            },
            lastName: {
              title: 'Фамилия',
              description: 'Введите фамилию личности.',
            },
            patronymic: {
              title: 'Отчество',
              description: 'Введите отчество личности.',
            },
            birthDate: {
              title: 'Дата Рождения',
              description: 'Выберите дату рождения личности.',
            },
            deathDate: {
              title: 'Дата Смерти',
              description: 'Выберите дату смерти личности.',
            },
            country: {
              title: 'Страна',
              description:
                'Это поле заполняется автоматически, когда вы выбираете место на карте.',
            },
            city: {
              title: 'Город',
              description:
                'Это поле заполняется автоматически, когда вы выбираете место на карте.',
            },
            biography: {
              title: 'Биография',
              description:
                'Расскажите немного о жизни личности в разделе биографии.',
            },
            selectPlace: {
              title: 'Выберите Место',
              description:
                'Выберите из опубликованных мест по имени, если вы знаете название места. Это может быть название кладбища или другого общего места захоронения людей. Это для объединения людей в кластеры.',
            },
            selectedPlaceInformation: {
              title: 'Информация о Выбранном Месте',
              description: 'Просмотрите информацию о выбранном месте.',
            },
            clearSelectedPlace: {
              title: 'Очистить Выбранное Место',
              description:
                'При необходимости вы можете очистить выбранное место.',
            },
            selectLocationOnMap: {
              title: 'Выберите Местоположение на Карте',
              description: 'Точно указывайте местоположение на карте.',
            },
            selectedLocationInformation: {
              title: 'Информация о Выбранном Местоположении',
              description:
                'Просмотрите информацию о точно указанном местоположении на карте.',
            },
            uploadPhotos: {
              title: 'Загрузить Фотографии',
              description:
                'Добавьте фотографии личности. Вы можете загрузить несколько фотографий.',
            },
            save: {
              title: 'Сохранить',
              description:
                "После заполнения всех деталей нажмите 'Сохранить', чтобы создать личность.",
            },
            tourCompleted: {
              title: 'Тур Завершен',
              description:
                'Поздравляю! Вы завершили процесс создания личности.',
            },
          },
        },
      },
      edit: {
        index: 'Редактировать персону',
        notification: {
          success: {
            title: 'Персона успешно обновлена',
            description: 'Вы будете перенаправлены на страницу персоны',
          },
          update: {
            title: 'Персона успешно обновлена',
          },
          delete: {
            title: 'Персона успешно удалена',
          },
          error: 'Ошибка при обновлении персоны',
        },
        button: {
          save: 'Сохранить',
          photo: '+ Загрузить',
        },
      },
      table: {
        id: 'ID',
        owner: 'Владелец',
        name: 'Имя',
        lastName: 'Фамилия',
        birthDate: 'Дата рождения',
        deathDate: 'Дата смерти',
        country: 'Страна',
        city: 'Город',
        createdAt: 'Создано',
        updatedAt: 'Обновлено',
        placeId: 'ID места',
        status: 'Статус',
        photos: 'Фотографии',
        actions: 'Действия',
      },
      notifications: {
        success: {
          title: 'Личность успешно создана',
          description: 'Вы будете перенаправлены на страницу личности',
        },
        delete: {
          title: 'Личность успешно удалена',
          description: 'Вы будете перенаправлены на страницу личностей',
        },
      },
      delete: {
        title: 'Удалить',
        titleConfirm: 'Подтвердить удаление',
        description: 'Вы уверены, что хотите удалить личность?',
        cancel: 'Отмена',
        delete: 'Удалить',
      },
      updateModal: {
        title: 'Изменить статус личности или редактировать',
        buttonTitle: 'Изменить статус личности',
        form: {
          label: 'Текущий статус',
        },
        edit: 'Редактировать',
        notification: {
          success: 'Статус успешно обновлен',
          error: 'Ошибка при обновлении статуса',
        },
      },
      tour: {
        next: 'Следующий',
        previous: 'Предыдущий',
        finish: 'Завершить',
        steps: {
          top: {
            title: 'Верх',
            description: 'Первый шаг, вы можете добавить нового человека.',
          },
          name: {
            title: 'Поиск по Имени',
            description: 'Введите имя для поиска человека.',
            placeHolder: 'Поиск по имени',
          },
          lastName: {
            title: 'Поиск по Фамилии',
            description: 'Введите фамилию для поиска человека.',
            placeHolder: 'Поиск по фамилии',
          },
          lang: {
            title: 'Выбор языка для контента',
            description: 'Выберите язык для просмотра контента на этом языке.',
            placeHolder: 'Выберите язык для контента',
          },
          filter: {
            title: 'Открыть фильтры',
            description: 'Нажмите здесь, чтобы открыть фильтры.',
          },
          dataBirth: {
            title: 'Поиск по Году Рождения',
            description:
              'Введите год рождения для поиска лиц, родившихся в этот год.',
            placeHolder: 'Год рождения',
          },
          dataDeath: {
            title: 'Поиск по Году Смерти',
            description:
              'Введите год смерти для поиска лиц, умерших в этот год.',
            placeHolder: 'Год смерти',
          },
          country: {
            title: 'Поиск по Стране',
            description: 'Введите страну для поиска лиц в этой стране.',
            placeHolder: 'Поиск по стране',
          },
          city: {
            title: 'Поиск по Городу',
            description: 'Введите город для поиска лиц в этом городе.',
            placeHolder: 'Поиск по городу',
          },
          table: {
            title: 'Таблица',
            description: 'Это таблица лиц. Здесь вы можете видеть их детали.',
          },
          next: {
            title: 'Следующая страница',
            description: 'Нажмите здесь, чтобы перейти к следующей странице.',
          },
          finish: {
            title: 'Размер страницы',
            description: 'Выберите количество элементов на странице здесь.',
          },
        },
      },
    },
    users: {
      index: 'Пользователи',
      indexH: 'Пользователь',
      search: {
        title: 'Поиск по имени',
        placeholder: 'Поиск по имени',
      },
      selectStatus: {
        all: 'Все',
        active: 'Активный',
        banned: 'Заблокирован',
        pending: 'В ожидании',
      },
      selectRole: {
        all: 'Все',
        admin: 'Администратор',
        editor: 'Редактор',
        author: 'Автор',
        user: 'Пользователь',
      },
      table: {
        id: 'ID',
        name: 'Имя',
        email: 'Адрес электронной почты',
        status: 'Статус',
        role: 'Роль',
        createdAt: 'Создано',
        updatedAt: 'Обновлено',
        view: 'Просмотреть профиль',
        actions: 'Действия',
      },
      notifications: {
        delete: {
          title: 'Пользователь успешно удален',
          description: 'Вы будете перенаправлены на страницу пользователей',
        },
      },
      list: {
        name: 'Имя',
        email: 'Адрес электронной почты',
        role: 'Роль',
        status: 'Статус',
        createdAt: 'Создано',
        updatedAt: 'Обновлено',
        items: {
          info: 'Инфо',
          places: 'Места',
          persons: 'Личности',
          articles: 'Статьи',
        },
      },
      drawer: {
        title: 'Профиль пользователя',
        more: 'подробнее…',
        name: 'Имя пользователя',
        city: 'Город',
        na: 'Незаполнено',
        email: 'Адрес электронной почты',
        userInformation: 'Информация о пользователе',
        status: 'Статус',
        role: 'Роль',
        places: 'Места',
        articles: 'Статьи',
        persons: 'Личности',
        drafts: 'Черновики',
        pending: 'В ожидании рецензии',
        published: 'Опубликовано',
        otherInformation: 'Другая информация',
        added: 'Добавлено',
        updated: 'Последнее обновление',
      },
      delete: {
        title: 'Удалить',
        titleConfirm: 'Подтвердить удаление',
        description: 'Вы уверены, что хотите удалить пользователя?',
        cancel: 'Отмена',
        delete: 'Удалить',
      },
      updateModal: {
        title: 'Изменить роль, статус пользователя или отредактировать',
        button: {
          title: 'Обновить статус и роль пользователя',
          update: 'Обновить',
        },
        form: {
          label: 'Текущая роль',
          label2: 'Текущий статус',
        },
        edit: 'Редактировать',
        notification: {
          updateRole: {
            success: 'Роль успешно обновлена',
          },
          updateStatus: {
            success: 'Статус успешно обновлен',
          },
        },
      },
    },
    contacts: {
      index: 'Контакты',
      form: {
        about: {
          label: 'О нас',
          placeholder: 'О нас',
          tooltip:
            'Вы можете написать до 10 000 символов. После написания вы должны сохранить контакты.',
          rules: {
            required: 'Поле "О нас" обязательно',
            max: 'Максимальная длина: 10 000 символов',
          },
        },
        socialNetworks: {
          facebook: {
            label: 'Facebook',
            placeholder: 'Введите ссылку',
            tooltip:
              'Необходимо ввести ссылку на группу или страницу в формате "https://www.facebook.com/...".',
            rules: {
              max: 'Максимальная длина: 120 символов',
              url: 'Поле "Facebook" должно быть валидным',
            },
          },
          telegram: {
            label: 'Telegram',
            placeholder: 'Введите ссылку',
            tooltip:
              'Необходимо ввести ссылку на группу или канал в формате "https://t.me/...".',
            rules: {
              max: 'Максимальная длина: 120 символов',
              url: 'Поле "Telegram" должно быть валидным',
            },
          },
          instagram: {
            label: 'Instagram',
            placeholder: 'Введите ссылку',
            tooltip:
              'Необходимо ввести ссылку на группу или страницу в формате "https://www.instagram.com/...".',
            rules: {
              max: 'Максимальная длина: 120 символов',
              url: 'Поле "Instagram" должно быть валидным',
            },
          },
          partners: {
            label: 'Партнеры',
            placeholder: 'Введите ссылку',
            tooltip: 'Необходимо ввести ссылку на группу или страницу.',
            rules: {
              max: 'Максимальная длина: 120 символов',
            },
          },
        },
        address: {
          label: 'Адрес',
          placeholder: 'Введите адрес',
          rules: {
            required: 'Поле "Адрес" обязательно',
          },
        },
        email: {
          label: 'Адрес электронной почты',
          placeholder: 'Введите email',
          rules: {
            required: 'Поле "Адрес электронной почты" обязательно',
            email: 'Адрес электронной почты должен быть валидным',
          },
        },
        updatedAt: 'Обновлено',
        save: 'Сохранить',
      },
      notification: {
        update: {
          title: 'Контакты успешно обновлены',
        },
        error: 'Ошибка при обновлении контактов',
      },
    },
    languages: {
      index: 'Языки',
      add: {
        label: '+ Добавить',
        title: 'Добавить язык',
      },
      edit: {
        title: 'Редактировать язык',
      },
      table: {
        id: 'ID',
        name: 'Название',
        native: 'Родной',
        code: 'Код',
        order: 'Порядок',
        createdAt: 'Создано в',
        updatedAt: 'Обновлено в',
        actions: 'Действия',
      },
      form: {
        title: 'Добавить язык',
        titleUpdate: 'Редактировать язык',
        name: {
          label: 'Название',
          placeholder: 'Название',
          rules: {
            required: 'Поле "Название" обязательно для заполнения',
            pattern: 'Название языка должно содержать только текст!',
            max: 'Максимальная длина: 60 символов',
          },
        },
        native: {
          label: 'Родной',
          placeholder: 'Родной',
          rules: {
            required: 'Поле "Родной" обязательно для заполнения',
            pattern: 'Название языка должно содержать только текст!',
            max: 'Максимальная длина: 60 символов',
          },
        },
        code: {
          label: 'Код',
          placeholder: 'Код',
          rules: {
            required: 'Поле "Код" обязательно для заполнения',
            pattern: 'Название языка должно содержать только текст!',
            max: 'Код должен быть не более 2 символов!',
          },
        },
        order: {
          label: 'Порядок',
          placeholder: 'Порядок',
          rules: {
            required: 'Поле "Порядок" обязательно для заполнения',
            pattern: 'Название языка должно содержать только цифры!',
            max: 'Порядок должен быть не более 2 символов!',
          },
        },
        save: 'Сохранить',
      },
      notifications: {
        success: {
          title: 'Язык успешно создан',
          description: 'Вы будете перенаправлены на страницу языка',
        },
        update: {
          title: 'Язык успешно обновлен',
          description: 'Вы будете перенаправлены на страницу языка',
        },
        delete: {
          title: 'Язык успешно удален',
          description: 'Вы будете перенаправлены на страницу языков',
        },
        error: 'Ошибка при создании языка',
      },
      delete: {
        title: 'Удалить',
        titleConfirm: 'Подтвердить удаление',
        description: 'Вы уверены, что хотите удалить язык?',
        cancel: 'Отмена',
        delete: 'Удалить',
      },
    },
    logout: {
      title: 'Выйти',
      description: 'Вы уверены, что хотите выйти?',
      cancel: 'Отмена',
      logout: 'Выйти',
      notifications: {
        success: {
          title: 'Вы успешно вышли',
        },
      },
    },
    rules: {
      required: 'Пожалуйста, введите',
      slug: {
        label: 'Слаг',
        placeholder: 'Это поле генерируется автоматически',
        tooltip: `Вы можете изменить слаг.
      Это поле для SEO, он должен быть уникальным и содержать только буквы, цифры и дефисы.
      Не может начинаться или заканчиваться дефисом.`,
        rules: {
          required: 'Поле Slug обязательно для заполнения',
          max: 'Максимальная длина: 120 символов',
          pattern: `Slug может содержать только буквы, цифры и дефисы.
  Не может начинаться или заканчиваться дефисом.`,
        },
      },
    },
    metaInfo: {
      publicLink: {
        label: 'Общая ссылка',
        no: 'Не опубликовано',
      },
      owner: 'Владелец',
      createdAt: 'Создано',
      updatedAt: 'Обновлено',
    },
    locationInfo: {
      label: 'Местоположение',
      formattedAddress: 'Форматированный адрес',
      longitude: 'Долгота',
      latitude: 'Широта',
      tooltip:
        "Вы должны выбрать местоположение на карте (ввести адрес, место в поле поиска или просто нажать на карте дважды). После выбора местоположения вы увидите маркер на карте, затем нужно нажать кнопку 'Заполнить таблицу' и нажать кнопку 'Заполнить форму'.",
      rules: {
        required: 'Поле "Местоположение" обязательно для заполнения',
      },
      search: 'Показать ваше местоположение или найти местоположение',
      buttons: {
        openMap: 'Открыть карту',
        clearTable: 'Очистить таблицу',
        fillTable: 'Заполнить таблицу',
        define: 'Определить местоположение',
        removeMarker: 'Удалить маркер',
        disable: 'Отключить клик по карте',
        enable: 'Включить клик по карте',
        panTo: 'Переместить на местоположение',
      },
      form: {
        country: {
          label: 'Страна',
          placeholder: 'Страна',
          rules: {
            required: 'Поле Страна обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        city: {
          label: 'Город',
          placeholder: 'Город',
          rules: {
            required: 'Поле Город обязательно для заполнения',
            max: 'Максимальная длина: 120 символов',
          },
        },
        address: {
          label: 'Адрес',
          placeholder: 'Адрес',
          rules: {
            required: 'Поле Адрес обязательно для заполнения',
            max: 'Максимальная длина: 180 символов',
          },
        },
        longitude: {
          label: 'Долгота',
          placeholder: 'Долгота',
          rules: {
            required: 'Поле Долгота обязательно для заполнения',
            type: 'Долгота должна быть числом',
            range: 'Долгота должна быть в диапазоне от -180 до 180',
            // min: 'Минимальное значение: -180',
            // max: 'Максимальное значение: 180',
            maxLength: 'Максимальная длина: 10 символов',
          },
        },
        latitude: {
          label: 'Широта',
          placeholder: 'Широта',
          rules: {
            required: 'Поле Широта обязательно для заполнения',
            type: 'Широта должна быть числом',
            range: 'Широта должна быть в диапазоне от -90 до 90',
            // min: 'Минимальное значение: -90',
            // max: 'Максимальное значение: 90',
            maxLength: 'Максимальная длина: 10 символов',
          },
        },
        administrativeAreaLevel1: {
          label: 'Штат',
          placeholder: 'Штат',
        },
        administrativeAreaLevel2: {
          label: 'Район',
          placeholder: 'Район',
        },
        street: {
          label: 'Улица',
          placeholder: 'Улица',
        },
        streetNumber: {
          label: 'Номер улицы',
          placeholder: 'Номер улицы',
        },
        buttons: {
          fillForm: 'Заполнить форму',
          details: {
            title: 'Показать больше деталей',
            open: 'Детали',
          },
        },
      },
    },
    updateStatus: {
      label: 'Cтатус',
      draft: 'Черновик',
      pending: 'Отправить на рецензирование',
      published: 'Опубликовать',
      archived: 'Архив',
    },
    selectStatus: {
      title: 'Выберите статус',
      all: 'Все',
      draft: 'Черновики',
      pending: 'Отправлено на рассмотрение',
      published: 'Опубликовано',
      archived: 'Архив',
    },
    selectFileType: {
      all: 'Все',
      articles: 'Статьи',
      places: 'Места',
      people: 'Люди',
    },
    delete: {
      title: 'Удалить',
      titleConfirm: 'Подтвердите удаление',
      description: 'Вы уверены, что хотите удалить?',
      cancel: 'Отмена',
      delete: 'Удалить',
    },
    modalInfo: {
      title: 'Уведомление о блокировке аккаунта',
      description: {
        paragraphs: [
          'Уважаемый пользователь, сообщаем вам, что ваш аккаунт в системе был временно заблокирован.',
          'Ваш доступ к некоторым функциям был ограничен. В данный момент вы можете только просматривать контент, но не имеете возможности вносить изменения.',
          'Если у вас есть вопросы или вы считаете, что блокировка была наложена ошибочно, пожалуйста, свяжитесь с нашей службой поддержки.',
          'Благодарим за понимание и сотрудничество.',
        ],
      },
      cancel: 'Отмена',
      ok: 'Ок',
    },
    save: 'Сохранить',
  },
};
